{
  "contextProvider": {
    "beforeUnload": {
      "message": "Are you sure you want to leave? Changes you made may not be saved."
    }
  },
  "navBar": {
    "codeEditor": "Code Editor",
    "encodeDecode": {
      "base64": "Base64",
      "hex": "Hex",
      "title": "Encode/Decode"
    },
    "localeSwitcher": {
      "english": "English",
      "vietnamese": "Tiếng Việt"
    },
    "sqlFormatter": "SQL Formatter",
    "svgEditor": "SVG Editor"
  },
  "page": {
    "base64": {
      "buttons": {
        "convert": "Convert"
      },
      "features": {
        "description": "The base64 converter provided by {siteName} is a free tool that helps you convert base64 to text immediately. Below are some of the main features of this online utility.",
        "items": {
          "item1": {
            "description": "There are no charges associated with the usage of this online base64 converter. You can use this utility for free and make as many conversions as you desire. You don’t need to get yourself registered to download the results.",
            "title": "100% Free"
          },
          "item2": {
            "description": "You don’t need to follow any convoluted procedure or download any software for accessing this base64 decoder. It is a web-based utility that can be easily accessed with a stable internet connection.",
            "title": "Easily Accessible"
          },
          "item3": {
            "description": "he user-friendly interface of this base64 code translator allows you to translate base64 to text online without any manual effort. You don’t need to acquire professional assistance to use this online facility.",
            "title": "User-friendly Interface"
          },
          "item4": {
            "description": "The base64 code translator provides 100% accurate results. This online utility uses advanced algorithms to process your entered base64 value and convert it into accurate textual form instantly.",
            "title": "Accurate Results"
          },
          "item5": {
            "description": "This free base64 translator is compatible with all devices. Whether you’re using an Android, Mac, iOS, Linux, or Windows device, this online utility efficiently works on all devices.",
            "title": "Compatibility"
          },
          "item6": {
            "description": "This base64 code converter provides fast and secure conversion to its users. You don't have to worry about the security of your uploaded data. All the entered data is automatically removed from the database, as soon as the conversion is completed. We’ll not save or share our user’s data with any third party vender.",
            "title": "Data Security"
          }
        },
        "title": "Features of Base64 to Text Converter"
      },
      "fields": {
        "input": {
          "errors": {
            "invalid_base64_string": "Invalid base64 string"
          },
          "placeholder": "Enter text to encode/decode"
        }
      },
      "howToUse": {
        "description": "With our base64 to text converter, you can convert and understand lengthy numerical codes of base64 easily. Follow the below steps to use this base64 translator: In a few simple steps, you will get the specific results just the way you want your base64 values to be converted in text.",
        "steps": {
          "step1": "Enter text to encode/decode",
          "step2": "Select decode or encode operation",
          "step3": "Click on Convert button, The result will appear immediately in the result box",
          "step4": "Click \"copy\" to use the result"
        },
        "title": "How to use base64 to text converter"
      },
      "metaData": {
        "description": "Convert base64 to text and base64 decode strings. Online tool for base64 decoding a string. Convert a base64 encoded text into an decoded string",
        "title": "Base64 to text and viceversa"
      },
      "operations": {
        "decode": "Base64 to Text",
        "encode": "Text to Base64"
      },
      "title": "Base64 Converter",
      "toast": {
        "copy": {
          "error": "Failed to copy to clipboard",
          "success": "Copied to clipboard"
        }
      },
      "what": {
        "description": "Base64 is a group of binary-to-text encoding schemes that transforms binary data into a sequence of printable characters, limited to a set of 64 unique characters. More specifically, the source binary data is taken 6 bits at a time, then this group of 6 bits is mapped to one of 64 unique characters.",
        "title": "What is Base64?"
      }
    },
    "codeEditor": {
      "buttons": {
        "copy": "Copy",
        "format": "Format",
        "save": "Save",
        "template": "Template"
      },
      "metaData": {
        "description": "Online code editor tool, format code and download directly",
        "title": "Code Editor"
      },
      "programmingLanguages": {
        "c": "C",
        "cpp": "C++",
        "csharp": "C#",
        "dart": "Dart",
        "go": "Go",
        "java": "Java",
        "javascript": "Javascript",
        "kotlin": "Kotlin",
        "php": "PHP",
        "python": "Python",
        "ruby": "Ruby",
        "rust": "Rust",
        "swift": "Swift",
        "typescript": "Typescript"
      },
      "title": "Code Editor",
      "toast": {
        "copy": {
          "error": "Failed to copy to clipboard",
          "success": "Copied to clipboard"
        },
        "runCode": {
          "error": "Unable to run code"
        }
      }
    },
    "hex": {
      "buttons": {
        "convert": "Convert"
      },
      "features": {
        "description": "The hexadecimal converter provided by {siteName} is a free tool that helps you convert hexadecimal to text immediately. Below are some of the main features of this online utility.",
        "items": {
          "item1": {
            "description": "There are no charges associated with the usage of this online hexadecimal converter. You can use this utility for free and make as many conversions as you desire. You don’t need to get yourself registered to download the results.",
            "title": "100% Free"
          },
          "item2": {
            "description": "You don’t need to follow any convoluted procedure or download any software for accessing this hexadecimal decoder. It is a web-based utility that can be easily accessed with a stable internet connection.",
            "title": "Easily Accessible"
          },
          "item3": {
            "description": "he user-friendly interface of this hex code translator allows you to translate hex to text online without any manual effort. You don’t need to acquire professional assistance to use this online facility.",
            "title": "User-friendly Interface"
          },
          "item4": {
            "description": "The hexadecimal code translator provides 100% accurate results. This online utility uses advanced algorithms to process your entered hex value and convert it into accurate textual form instantly.",
            "title": "Accurate Results"
          },
          "item5": {
            "description": "This free hex translator is compatible with all devices. Whether you’re using an Android, Mac, iOS, Linux, or Windows device, this online utility efficiently works on all devices.",
            "title": "Compatibility"
          },
          "item6": {
            "description": "This hex code converter provides fast and secure conversion to its users. You don't have to worry about the security of your uploaded data. All the entered data is automatically removed from the database, as soon as the conversion is completed. We’ll not save or share our user’s data with any third party vender.",
            "title": "Data Security"
          }
        },
        "title": "Features of Hex to Text Converter"
      },
      "fields": {
        "input": {
          "errors": {
            "invalid_hex_string": "Invalid hex string"
          },
          "placeholder": "Enter text to encode/decode"
        }
      },
      "howToUse": {
        "description": "With our hexadecimal to text converter, you can convert and understand lengthy numerical codes of hexadecimal easily. Follow the below steps to use this hexadecimal translator: In a few simple steps, you will get the specific results just the way you want your hex values to be converted in text.",
        "steps": {
          "step1": "Enter text to encode/decode",
          "step2": "Select decode or encode operation",
          "step3": "Click on Convert button, The result will appear immediately in the result box",
          "step4": "Click \"copy\" to use the result"
        },
        "title": "How to use hex to text converter"
      },
      "metaData": {
        "description": "Convert hex to text and hex decode strings. Online tool for hex decoding a string. Convert a hexadecimaly encoded text into an decoded string",
        "title": "Hex to text and viceversa"
      },
      "operations": {
        "decode": "Hex to Text",
        "encode": "Text to Hex"
      },
      "title": "Hex Converter",
      "toast": {
        "copy": {
          "error": "Failed to copy to clipboard",
          "success": "Copied to clipboard"
        }
      },
      "what": {
        "description": "When beginning web development, programmers use either a numerical system translator such as a hex converter or an assembly language. Assembly language comprehends the same instructions in numeric codes as a machine language, but the data commands and variables are translated into readable English alphabets, rather than just numbers.",
        "title": "What is Hexadecimal Number System?"
      }
    },
    "home": {
      "dataPrivacy": {
        "description": "Your privacy is important to us. We promise not to store or pass on any of the data that you send to us via our online conversion, encode or decode tools. The data that you send to us will simply be converted in the way that you require and the results sent back to you. For the extra security of an encrypted connection please also enable SSL.",
        "title": "Data Privacy"
      },
      "metaData": {
        "description": "Online tools for encoding, decoding hex, base64, online editing sv images",
        "title": "Multi-Tools for converting string, image,..."
      },
      "pageDescription": {
        "description": "\"{siteName}\" is a versatile web application designed to streamline various development tasks in one convenient platform. From converting hex and base64 to text to providing an online SVG code editor, SQL editor, and a multi-language code editor with execution capabilities, {siteName} caters to developers and tech enthusiasts alike. Whether you need to manipulate data, write SQL queries, or code in languages like C# and Java, {siteName} has you covered with an intuitive, accessible online interface.",
        "title": "{siteName} The Ultimate Online Code and Data Conversion Toolkit"
      },
      "section": {
        "codeEditorTools": {
          "items": {
            "codeEditor": {
              "title": "Code Editor",
              "tooltip": "A versatile online code editor supporting multiple programming languages, including C# and Java. With built-in code execution capabilities, you can write, test, and debug code right in your browser."
            }
          },
          "title": "Code Editor Tools"
        },
        "converterTools": {
          "items": {
            "base64": {
              "title": "Base64",
              "tooltip": "Encode or decode Base64 data, a common encoding scheme used for data transfer and storage. This tool helps you quickly convert Base64 strings to readable text or files."
            },
            "hex": {
              "title": "Hex",
              "tooltip": "Convert hexadecimal data to text and vice versa. Hexadecimal is a base-16 number system used in computing and digital electronics."
            }
          },
          "title": "Converter Tools"
        },
        "formatterTools": {
          "items": {
            "sql": {
              "title": "SQL Formatter",
              "tooltip": "Format SQL code online with this handy tool. Choose your preferred language, tab width, and case settings to generate clean, readable SQL scripts."
            }
          },
          "title": "Formatter Tools"
        },
        "imageTools": {
          "items": {
            "svg": {
              "title": "SVG",
              "tooltip": "Edit SVG code online with this versatile tool. Preview your SVG images and download them in various formats."
            }
          },
          "title": "Image Tools"
        }
      },
      "title": "MultiTools",
      "whoBenefit": {
        "description": "Whether you're a software developer, data analyst, or hobbyist, {siteName} has something for everyone. Here are some ideal use cases:",
        "items": {
          "item1": {
            "description": "Streamline your coding process with our multi-language code editor, allowing you to write and execute code quickly.",
            "title": "Software Developers"
          },
          "item2": {
            "description": "Use our data conversion tools to manipulate various data formats seamlessly.",
            "title": "Data Analysts"
          },
          "item3": {
            "description": "Edit SVG code directly in your browser to create and modify scalable vector graphics on the go.",
            "title": "Designers & Creators"
          }
        },
        "title": "Who Can Benefit from {siteName}?"
      },
      "whyUse": {
        "description": "{siteName} is more than just a code editor—it's a comprehensive toolkit built to make your development process faster, more efficient, and secure. Here’s what sets us apart:",
        "items": {
          "item1": {
            "description": "Say goodbye to switching between different tools. With {siteName}, you have everything you need in one place, from code execution and data conversion to specialized editors for SQL and SVG.",
            "title": "All-in-One Platform"
          },
          "item2": {
            "description": "We prioritize your data security by employing industry-standard encryption and secure execution environments. Whether you’re running code or handling sensitive data, {siteName} ensures your work remains private and protected.",
            "title": "Enhanced Security"
          },
          "item3": {
            "description": "Designed for both beginners and experienced developers, our platform offers a clean and intuitive interface, enabling you to focus on what matters most—your work.",
            "title": "User-Friendly Interface"
          },
          "item4": {
            "description": "Access your tools from anywhere, anytime. As a web-based platform, {siteName} provides the flexibility to work on your projects across devices without the need for local installations or updates.",
            "title": "Cloud-Based Convenience"
          }
        },
        "title": "Why Choose {siteName}?"
      }
    },
    "sqlFormatter": {
      "buttons": {
        "copy": "Copy",
        "format": "Format",
        "save": "Save",
        "upload": "Upload"
      },
      "fields": {
        "dataTypeCase": {
          "label": "Data Type Case"
        },
        "functionCase": {
          "label": "Function Case"
        },
        "keywordCase": {
          "label": "Keyword Case"
        },
        "language": {
          "label": "Language"
        },
        "lineBetweenQueries": {
          "label": "Line Between Queries"
        },
        "tabWidth": {
          "label": "Tab Width"
        }
      },
      "metaData": {
        "description": "Online SQL formatter tool, format SQL code and download directly",
        "title": "Format SQL online"
      },
      "sqlLanguages": {
        "mysql": "MySql",
        "postgresql": "PostgreSql",
        "sql": "Sql",
        "sqlite": "SQLite",
        "transactsql": "Transact-Sql"
      },
      "textCases": {
        "lowercase": "Lower Case",
        "preserve": "Preserve",
        "uppercase": "Upper Case"
      },
      "title": "SQL Formatter",
      "toast": {
        "copy": {
          "error": "Failed to copy to clipboard",
          "success": "Copied to clipboard"
        },
        "format": {
          "error": "Error while formatting SQL script, please select another language!"
        }
      }
    },
    "svgPlayGround": {
      "buttons": {
        "copy": "Copy",
        "format": "Format",
        "save": "Save",
        "upload": "Upload"
      },
      "metaData": {
        "description": "Online SVG code editor tool, preview image and download directly",
        "title": "SVG Playground for editing svg code"
      },
      "title": "SVG PlayGround",
      "toast": {
        "copy": {
          "error": "Failed to copy to clipboard",
          "success": "Copied to clipboard"
        }
      }
    }
  }
}
